# CanUseHardPoints Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
AnalyticalModel..::..CanUseHardPoints Method
AnalyticalModel Class See Also
---
Indicates if Analytical Model can use Hard Points.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool CanUseHardPoints()
```

Visual Basic
---
```text
Public Function CanUseHardPoints As Boolean
```

Visual C++
---
```text
public:
bool CanUseHardPoints()
```

# ### Return Value
True if Analytical Model can use Hard Points, false otherwise.
# See Also
AnalyticalModel Class
Autodesk.Revit.DB.Structure Namespace